
#### Terraform Plan

```Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
terraform/app_environment relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/cms/cms/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/cms/cms

To view this run in a browser, visit:
https://app.terraform.io/app/owenbendavies/cms-staging/runs/run-fGe2QtWVGiiQxehL

Waiting for the plan to start...

Terraform v0.12.28
Configuring remote state backend...
Initializing Terraform configuration...
2020/07/21 15:56:22 [DEBUG] Using modified User-Agent: Terraform/0.12.28 TFC/9ebf03fc0c
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.aws_iam.data.aws_iam_policy_document.ses: Refreshing state...
module.aws_cloudfront.data.aws_caller_identity.main: Refreshing state...
module.aws_iam.aws_iam_user.app: Refreshing state... [id=obduk-cms-staging]
module.aws_cloudfront.aws_cloudfront_origin_access_identity.assets: Refreshing state... [id=E3JMA6ZTI85JQY]
module.aws_s3.data.aws_caller_identity.main: Refreshing state...
module.aws_s3.aws_s3_bucket.logs: Refreshing state... [id=obduk-cms-staging-logs]
module.aws_cognito.aws_cognito_user_pool.app: Refreshing state... [id=eu-west-1_D1lSlBOF6]
module.aws_iam.aws_iam_access_key.app: Refreshing state... [id=AKIAJ2AL4ZEMK3VVD67Q]
module.aws_iam.aws_iam_user_policy.app_ses: Refreshing state... [id=obduk-cms-staging:ses]
module.aws_cognito.aws_cognito_user_pool_client.app: Refreshing state... [id=688dieialpg77jph3hieh43jbl]
module.aws_cognito.aws_cognito_user_pool_domain.app: Refreshing state... [id=obduk-cms-staging]
module.aws_cognito.aws_cognito_user_group.admin: Refreshing state... [id=eu-west-1_D1lSlBOF6/admin]
module.aws_cognito.aws_cognito_user_group.domains["obduk-cms-staging.herokuapp.com"]: Refreshing state... [id=eu-west-1_D1lSlBOF6/obduk-cms-staging.herokuapp.com]
module.aws_iam.data.aws_iam_policy_document.cognito: Refreshing state...
module.aws_iam.aws_iam_user_policy.app_cognito: Refreshing state... [id=obduk-cms-staging:cognito]
module.aws_s3.aws_s3_bucket_public_access_block.logs: Refreshing state... [id=obduk-cms-staging-logs]
module.aws_s3.aws_s3_bucket.assets: Refreshing state... [id=obduk-cms-staging]
module.aws_iam.data.aws_iam_policy_document.s3: Refreshing state...
module.aws_s3.aws_s3_bucket_public_access_block.assets: Refreshing state... [id=obduk-cms-staging]
module.aws_s3.data.aws_iam_policy_document.assets: Refreshing state...
module.aws_cloudfront.aws_cloudfront_distribution.assets: Refreshing state... [id=E1STRWN0US69TO]
module.aws_iam.aws_iam_user_policy.app_s3: Refreshing state... [id=obduk-cms-staging:s3]
module.aws_s3.aws_s3_bucket_policy.assets: Refreshing state... [id=obduk-cms-staging]
module.heroku.heroku_app.app: Refreshing state... [id=obduk-cms-staging]
module.heroku.heroku_app_feature.app_log_runtime_metrics: Refreshing state... [id=obduk-cms-staging:38237df0-7bf3-4c94-b0a7-bd277029cf2d]
module.heroku.heroku_addon.app_rollbar: Refreshing state... [id=b3eb729b-cc76-463b-ba11-ebd113df4c18]
module.heroku.heroku_app_feature.api_runtime_dyno_metadata: Refreshing state... [id=obduk-cms-staging:33146ed7-199e-4a8a-b648-08fd0b52e10d]
module.heroku.heroku_addon.app_scheduler: Refreshing state... [id=c0c8f87c-27e2-4bea-aaf5-0b8e110697e4]
module.heroku.heroku_formation.app_worker: Refreshing state... [id=19dfeffa-103c-4861-967c-46d05ea96011]
module.heroku.heroku_formation.app_web: Refreshing state... [id=3c8483c9-5184-4de9-9236-d742641b850e]
module.heroku.heroku_addon.app_scout: Refreshing state... [id=be37392e-80d5-42ba-a5a4-c09383e69b99]
module.heroku.heroku_addon.app_librato: Refreshing state... [id=f1eaede8-034c-4ae2-a278-fa2fb53a0dfe]
module.heroku.heroku_addon.app_postgresql: Refreshing state... [id=a91439e3-c47f-4557-a5e7-0310d792aeb5]
module.heroku.heroku_addon.app_logentries: Refreshing state... [id=ae2833f5-8eb6-4c6f-bd2e-57c6fb2bdd1f]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.aws_iam.data.aws_iam_policy_document.sqs will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "sqs"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:ChangeMessageVisibility",
              + "sqs:DeleteMessage",
              + "sqs:GetQueueAttributes",
              + "sqs:GetQueueUrl",
              + "sqs:ReceiveMessage",
              + "sqs:SendMessage",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.aws_iam.aws_iam_user_policy.app_sqs will be created
  + resource "aws_iam_user_policy" "app_sqs" {
      + id     = (known after apply)
      + name   = "sqs"
      + policy = (known after apply)
      + user   = "obduk-cms-staging"
    }

  # module.aws_sqs_default.aws_sqs_queue.main will be created
  + resource "aws_sqs_queue" "main" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "obduk-cms-staging-default"
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + tags                              = {
          + "environment" = "staging"
          + "project"     = "cms"
        }
      + visibility_timeout_seconds        = 30
    }

  # module.aws_sqs_mailers.aws_sqs_queue.main will be created
  + resource "aws_sqs_queue" "main" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "obduk-cms-staging-mailers"
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + tags                              = {
          + "environment" = "staging"
          + "project"     = "cms"
        }
      + visibility_timeout_seconds        = 30
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
